https://www.cnblogs.com/chenhuabin/p/10485549.html

1）选取某一整行（多个整行）或某一整列（多个整列）数据时，可以用df[]、df.loc[]、df.iloc[]，此时df[]的方法书写要简单一些。

　　2）进行区域选取时，如果只能用标签索引，则使用df.loc[]或df.ix[]，如果只能用整数索引，则用df.iloc[]或df.ix[]。不过我看到有资料说，不建议使用df.ix[],因为df.loc[]和df.iloc[]更精确（有吗？我没理解精确在哪，望告知）。

　　3）如果选取单元格，则df.at[]、df.iat[]、df.loc[]、df.iloc[]都可以，不过要注意参数。　　

　　4）选取数据时，返回值存在以下情况：

如果返回值包括单行多列或多行单列时，返回值为Series对象；
如果返回值包括多行多列时，返回值为DataFrame对象；
如果返回值仅为一个单元格（单行单列）时，返回值为基本数据类型，例如str，int等。
　　5）df[]的方式只能选取行和列数据，不能精确到单元格，所以df[]的返回值一定DataFrame或Series对象。

　　6）当使用DataFrame的默认索引（整数索引）时，整数索引即为标签索引。例如，使用上面的data实例化一个DataFrame对象：

In [ ]:
import pandas as pd
import numpy as np

In [5]:
data = {'name': ['Joe', 'Mike', 'Jack', 'Rose', 'David', 'Marry', 'Wansi', 'Sidy', 'Jason', 'Even'],

        'age': [25, 32, 18, np.nan, 15, 20, 41, np.nan, 37, 32],

        'gender': [1, 0, 1, 1, 0, 1, 0, 0, 1, 0],

        'isMarried': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [6]:
df = pd.DataFrame(data, index=labels)

In [7]:
df

    age  gender isMarried   name
a  25.0       1       yes    Joe
b  32.0       0       yes   Mike
c  18.0       1        no   Jack
d   NaN       1       yes   Rose
e  15.0       0        no  David
f  20.0       1        no  Marry
g  41.0       0        no  Wansi
h   NaN       0       yes   Sidy
i  37.0       1        no  Jason
j  32.0       0        no   Even

In [8]:
# 行（列）选取：df[]

In [9]:
df[0:1]

    age  gender isMarried name
a  25.0       1       yes  Joe

In [10]:
df[0:2]

    age  gender isMarried  name
a  25.0       1       yes   Joe
b  32.0       0       yes  Mike

In [12]:
df[:'b']

    age  gender isMarried  name
a  25.0       1       yes   Joe
b  32.0       0       yes  Mike

In [13]:
df['a':'c']

    age  gender isMarried  name
a  25.0       1       yes   Joe
b  32.0       0       yes  Mike
c  18.0       1        no  Jack

In [14]:
df[[True,True,True,False,False,False,False,False,False,False]]

    age  gender isMarried  name
a  25.0       1       yes   Joe
b  32.0       0       yes  Mike
c  18.0       1        no  Jack

In [15]:
df[[each>30 for each in df['age']]]

    age  gender isMarried   name
b  32.0       0       yes   Mike
g  41.0       0        no  Wansi
i  37.0       1        no  Jason
j  32.0       0        no   Even

In [16]:
df[df['age']>30]

    age  gender isMarried   name
b  32.0       0       yes   Mike
g  41.0       0        no  Wansi
i  37.0       1        no  Jason
j  32.0       0        no   Even

In [17]:
df[(df['age']>30) & (df['isMarried']=='no')]

    age  gender isMarried   name
g  41.0       0        no  Wansi
i  37.0       1        no  Jason
j  32.0       0        no   Even

# 2）列选取

In [19]:
df['name']

a      Joe
b     Mike
c     Jack
d     Rose
e    David
f    Marry
g    Wansi
h     Sidy
i    Jason
j     Even
Name: name, dtype: object

In [20]:
df[['name','age']]

    name   age
a    Joe  25.0
b   Mike  32.0
c   Jack  18.0
d   Rose   NaN
e  David  15.0
f  Marry  20.0
g  Wansi  41.0
h   Sidy   NaN
i  Jason  37.0
j   Even  32.0

In [21]:
df[lambda df: df.columns[0]]

a    25.0
b    32.0
c    18.0
d     NaN
e    15.0
f    20.0
g    41.0
h     NaN
i    37.0
j    32.0
Name: age, dtype: float64

In [22]:
# 3 区域选取

In [26]:
df.loc['a', :]

age           25
gender         1
isMarried    yes
name         Joe
Name: a, dtype: object

In [24]:
df.loc[['a','b','c'], :]

    age  gender isMarried  name
a  25.0       1       yes   Joe
b  32.0       0       yes  Mike
c  18.0       1        no  Jack

In [27]:
df.loc['a':'d', :]

    age  gender isMarried  name
a  25.0       1       yes   Joe
b  32.0       0       yes  Mike
c  18.0       1        no  Jack
d   NaN       1       yes  Rose

In [28]:
df.loc[[True,True,True,False,False,False], :]

    age  gender isMarried  name
a  25.0       1       yes   Joe
b  32.0       0       yes  Mike
c  18.0       1        no  Jack

In [29]:
 df.loc[df['age']>30,:]

    age  gender isMarried   name
b  32.0       0       yes   Mike
g  41.0       0        no  Wansi
i  37.0       1        no  Jason
j  32.0       0        no   Even

In [30]:
df.loc[df.loc[:,'age']>30, :]

    age  gender isMarried   name
b  32.0       0       yes   Mike
g  41.0       0        no  Wansi
i  37.0       1        no  Jason
j  32.0       0        no   Even

In [31]:
df.loc[lambda df:df['age'] > 30, :]

    age  gender isMarried   name
b  32.0       0       yes   Mike
g  41.0       0        no  Wansi
i  37.0       1        no  Jason
j  32.0       0        no   Even

In [32]:
df.loc[:, 'name']

a      Joe
b     Mike
c     Jack
d     Rose
e    David
f    Marry
g    Wansi
h     Sidy
i    Jason
j     Even
Name: name, dtype: object

In [38]:
df.loc[:,'name':'age']####################################

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g, h, i, j]

In [39]:
df.loc[:, ['name','age','isMarried']]

    name   age isMarried
a    Joe  25.0       yes
b   Mike  32.0       yes
c   Jack  18.0        no
d   Rose   NaN       yes
e  David  15.0        no
f  Marry  20.0        no
g  Wansi  41.0        no
h   Sidy   NaN       yes
i  Jason  37.0        no
j   Even  32.0        no

In [40]:
df.loc[df['age']>30,['name','age']]

    name   age
b   Mike  32.0
g  Wansi  41.0
i  Jason  37.0
j   Even  32.0

# 3.2 df.iloc[]

In [41]:
df.iloc[1, :]

age            32
gender          0
isMarried     yes
name         Mike
Name: b, dtype: object

In [42]:
df.iloc[[1,3,5],:]

    age  gender isMarried   name
b  32.0       0       yes   Mike
d   NaN       1       yes   Rose
f  20.0       1        no  Marry

# 3.3 df.ix[]

In [44]:
df.ix[2,'name']

'Jack'

In [45]:
df.ix[['a','c'], [0,1,3]]

    age  gender  name
a  25.0       1   Joe
c  18.0       1  Jack

# 4 单元格选取

In [46]:
df.at['b','name']

'Mike'

In [49]:
df.iat[1,0]

32.0